Conf.Simple/src/Catalogs/SUI_ПрисоединенныеФайлыОбщие/SUI_ПрисоединенныеФайлыОбщие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_ПрисоединенныеФайлыОбщие</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.SUI_НастройкиКонфигурацийПриложений</types>
      <types>CatalogRef.SUI_КонфигурацииПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модифицировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

Conf.Simple/src/Catalogs/SUI_ПрисоединенныеФайлыОбщие/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтобразитьПредставлениеРазмераФайла();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ЗначениеЗаполнено(ЗагруженныйФайлДвоичныеДанные) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДвоичныеДанные", ЗагруженныйФайлДвоичныеДанные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗагруженныйФайлПуть) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПутьКФайлу", ЗагруженныйФайлПуть);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОтобразитьПредставлениеРазмераФайла();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьФайл(Команда)
	
	АдресФайла = ПолучитьАдресФайлаДляВыгрузки();
	
	Если Не ЗначениеЗаполнено(АдресФайла) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Отсутствуют данные для выгрузки'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВыгрузитьФайлЗавершение", ЭтотОбъект);

	Если ЗначениеЗаполнено(Объект.ИмяФайла) Тогда
		ИмяФайлаДляВыгрузки = ОбщегоНазначенияКлиентСервер.ПолучитьИмяСРасширением(Объект.ИмяФайла, Объект.Расширение);
	Иначе
		ИмяФайлаДляВыгрузки = Объект.Наименование;
	КонецЕсли;

	ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, АдресФайла, ИмяФайлаДляВыгрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	ПараметрыЗагрузкиФайла = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузкиФайла.Диалог.ПроверятьСуществованиеФайла = Истина;
	ПараметрыЗагрузкиФайла.ИдентификаторФормы = УникальныйИдентификатор;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтотОбъект);
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузкиФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименование(Команда)
	
	ЗаполнитьНаименованиеИзИмениФайлаИРасширения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьАдресФайлаДляВыгрузки()
	
	Перем Адрес;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_ПрисоединенныеФайлыОбщие.ФайлХранилище
		|ИЗ
		|	Справочник.SUI_ПрисоединенныеФайлыОбщие КАК SUI_ПрисоединенныеФайлыОбщие
		|ГДЕ
		|	SUI_ПрисоединенныеФайлыОбщие.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ОписаниеТипаДвоичныеДанные = Новый ОписаниеТипов("ДвоичныеДанные");
		ДвоичныеДанныеФайла = ОписаниеТипаДвоичныеДанные.ПривестиЗначение(Выборка.ФайлХранилище.Получить());
	
		Если ЗначениеЗаполнено(ДвоичныеДанныеФайла) Тогда
			Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла);
		КонецЕсли;
		
	КонецЕсли;

	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьФайлЗавершение(ВыгруженныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыгруженныеФайлы) Тогда
		Возврат;
	КонецЕсли;

	ФайловаяСистемаКлиент.ОткрытьПроводник(ВыгруженныеФайлы[0].ПолноеИмя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагруженныйФайлПуть = Результат.Имя;
	ЗагруженныйФайлДвоичныеДанные = ПолучитьИзВременногоХранилища(Результат.Хранение);
	
	Если ЗагрузитьФайлОбработатьЗавершениеНаСервере() Тогда
		
		ОтобразитьПредставлениеРазмераФайла();
		
		Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
			ЗаполнитьНаименованиеИзИмениФайлаИРасширения();
		КонецЕсли;
		
		Модифицированность = Истина;
		
	Иначе
		ЗагруженныйФайлПуть = "";
		ЗагруженныйФайлДвоичныеДанные = Неопределено;
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось получить данные загруженного файла'"));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗагрузитьФайлОбработатьЗавершениеНаСервере()
	
	СведенияОДвоичныхДанных = Справочники.SUI_ПрисоединенныеФайлыОбщие.ПолучитьСведенияОДвоичныхДанных(ЗагруженныйФайлДвоичныеДанные);
	СведенияОПутиФайла = Справочники.SUI_ПрисоединенныеФайлыОбщие.ПолучитьСведенияОПутиФайла(ЗагруженныйФайлПуть);
	
	Если Не ЗначениеЗаполнено(СведенияОДвоичныхДанных.ДвоичныеДанные) Или
		ПустаяСтрока(СведенияОПутиФайла.ИмяФайла) Тогда
		Возврат Ложь;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(Объект, СведенияОДвоичныхДанных);
	ЗаполнитьЗначенияСвойств(Объект, СведенияОПутиФайла);

	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОтобразитьПредставлениеРазмераФайла()
	
	ПредставлениеРазмера = SUI_РаботаСФайламиКлиентСервер.ПредставлениеРазмераФайла(Объект.Размер);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименованиеИзИмениФайлаИРасширения()
	
	Объект.Наименование = ОбщегоНазначенияКлиентСервер.ПолучитьИмяСРасширением(Объект.ИмяФайла, Объект.Расширение);
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
